#Repos generated by the dump
tap "atlassian/tap"
tap "caskroom/cask"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"
tap "homebrew/services"
tap "ngrok/ngrok"

#shell-related
brew "bash"
brew "bat"
brew "direnv"
brew "zsh"
brew "exa"
brew "bat"
brew "oh-my-zsh"
brew "telnet"

# the editor!
brew "neovim"

# programming language-related
brew "ruby"
brew "groovy"
brew "node"
brew "groovy"
brew "maven"
brew "node", link: false
brew "nvm"
brew "atlassian/tap/atlassian-plugin-sdk"


# programming and ops tools
brew "ctags"
brew "dive"
brew "docker-clean"
brew "git"
brew "diff-so-fancy"

# encryption-relate
brew "gnupg"
brew "gpgme"
cask "gpg-suite"
brew "openssl"

# handy cli tools
brew "jq"
brew "pstree"
brew "ripgrep"
brew "tmux"
brew "tree"
brew "watch"
brew "wget"
brew "telnet"

# commonly needed libs
brew "libffi"
brew "libpng"
brew "libyaml"
brew "readline"
brew "zlib"

#casks
cask "dropbox"
cask "fig"
cask "google-chrome"
cask "intellij-idea"
cask "jetbrains-toolbox"
cask "ngrok"
cask "notion"
cask "spotify"
cask "zoomus"



